{
  "privacy": "Privacy",
  "terms": "Terms",
  "cookies": "Cookie",
  "contact": "Contact",
  "last_updated": "Last updated: October 23, 2025",
  "back_home": "Back to Home",
  
  "privacy_title": "Privacy Policy",
  "privacy_intro_title": "Introduction",
  "privacy_intro_content": "This Privacy Policy describes how Killer Sudoku Score collects, uses, and protects your information when you use our web application.",
  "privacy_collect_title": "Information We Collect",
  "privacy_collect_content": "We collect minimal information necessary to provide our service: username (for leaderboard participation), game statistics (scores, completion times), and technical data (browser type, device information).",
  "privacy_use_title": "How We Use Your Information",
  "privacy_use_content": "Your information is used solely to: provide game functionality, maintain leaderboards, improve user experience, and ensure service security. We do not sell or share your personal data with third parties.",
  "privacy_storage_title": "Data Storage and Security",
  "privacy_storage_content": "Your data is stored securely using industry-standard encryption. We implement appropriate technical and organizational measures to protect against unauthorized access, alteration, disclosure, or destruction.",
  "privacy_cookies_title": "Cookies and Local Storage",
  "privacy_cookies_content": "We use cookies and local storage to remember your preferences, game progress, and language settings. You can disable cookies in your browser settings, though this may affect functionality.",
  "privacy_rights_title": "Your Rights",
  "privacy_rights_content": "You have the right to access, update, or delete your personal data. Contact us to exercise these rights. You can also opt out of leaderboard participation by using visitor mode.",
  "privacy_changes_title": "Changes to This Policy",
  "privacy_changes_content": "We may update this Privacy Policy periodically. We will notify users of significant changes through our application or website.",
  "privacy_contact_title": "Contact Information",
  "privacy_contact_content": "If you have questions about this Privacy Policy, please contact us through our contact page.",
  
  "terms_title": "Terms of Service",
  "terms_intro_title": "Introduction",
  "terms_intro_content": "These Terms of Service govern your use of Killer Sudoku Score. By using our service, you agree to these terms.",
  "terms_accept_title": "Acceptance of Terms",
  "terms_accept_content": "By accessing and using Killer Sudoku Score, you accept and agree to be bound by the terms and provision of this agreement.",
  "terms_license_title": "Use License",
  "terms_license_content": "Permission is granted to temporarily use Killer Sudoku Score for personal, non-commercial transitory viewing only. This is the grant of a license, not a transfer of title.",
  "terms_restrictions_title": "Restrictions",
  "terms_restrictions_content": "You may not: modify or copy the materials, use the materials for any commercial purpose or for any public display, attempt to reverse engineer any software contained in the application.",
  "terms_conduct_title": "User Conduct",
  "terms_conduct_content": "Users must not engage in any activity that disrupts or interferes with the service, including but not limited to: cheating, hacking, or attempting to manipulate game scores.",
  "terms_privacy_title": "Privacy Policy",
  "terms_privacy_content": "Your privacy is important to us. Please review our Privacy Policy, which also governs your use of the service.",
  "terms_modifications_title": "Modifications",
  "terms_modifications_content": "We reserve the right to modify these terms at any time. We will notify users of significant changes through our application or website.",
  "terms_termination_title": "Termination",
  "terms_termination_content": "We may terminate or suspend your access to our service immediately, without prior notice or liability, for any reason whatsoever.",
  "terms_contact_title": "Contact Information",
  "terms_contact_content": "If you have any questions about these Terms of Service, please contact us through our contact page.",
  
  "cookie_title": "Cookie Policy",
  "cookie_intro_title": "Introduction",
  "cookie_intro_content": "This Cookie Policy explains how Killer Sudoku Score uses cookies and local storage technologies to improve your experience.",
  "cookie_what_title": "What are Cookies?",
  "cookie_what_content": "Cookies are small text files stored on your device that help us remember your preferences and improve website functionality.",
  "cookie_types_title": "Types of Cookies We Use",
  "cookie_types_content": "Essential Cookies: These cookies are necessary for the website to function properly and cannot be disabled. Functional Cookies: Remember your language settings, game progress, and user preferences. Analytics Cookies: Help us understand website usage and improve user experience.",
  "cookie_storage_title": "Local Storage",
  "cookie_storage_content": "We use your browser's local storage to save your game progress, settings, and statistics so you can continue playing on your next visit.",
  "cookie_manage_title": "How to Manage Cookies",
  "cookie_manage_content": "You can manage or delete cookies through your browser settings. Please note that disabling certain cookies may affect website functionality.",
  "cookie_third_title": "Third-Party Cookies",
  "cookie_third_content": "We may use third-party services (such as Google Analytics) to analyze website usage, and these services may set their own cookies.",
  "cookie_contact_title": "Contact Us",
  "cookie_contact_content": "If you have any questions about our Cookie Policy, please contact us through our contact page.",
  
  "contact_title": "Contact Us",
  "contact_email_title": "Email",
  "contact_email_content": "Please contact us at the following email address:",
  "contact_email_response": "We will respond to your email within 24 hours.",
  "contact_issues_title": "Report Issues",
  "contact_issues_content": "If you encounter any problems or find bugs while using the application, please describe the issue in detail and we will address it promptly.",
  "contact_suggestions_title": "Feature Suggestions",
  "contact_suggestions_content": "We welcome your feature suggestions! If you have any ideas to improve the gaming experience, please let us know.",
  "contact_github_title": "GitHub",
  "contact_github_content": "You can also check for the latest updates and submit issues on our GitHub project page:",
  "contact_faq_title": "Frequently Asked Questions",
  "contact_faq_q1": "Q: How do I reset my game progress?",
  "contact_faq_a1": "A: You can clear your browser's local storage data or use visitor mode to start fresh.",
  "contact_faq_q2": "Q: How is the leaderboard score calculated?",
  "contact_faq_a2": "A: The score calculation formula is: Final Score = max(Basic Score × 0.2, Basic Score + Time Bonus - Mistake Penalty)",
  "contact_faq_q3": "Q: Can I play offline?",
  "contact_faq_a3": "A: Yes, the game can be played offline, but you need an internet connection to view the leaderboard."
}
